// в этой части изучаю что такое библиотеки и как их использовать
// библиотека это какой то код, либо маленький либо большой
// который нужен для решения определенной проблемы
// это готовое решение
// взял - использовал

// изучение проводится на примере библиотеки axios

// установка
    // максимально правильное использование через npm 'npm install axios'
    // обычный способ через подлючение скрипта '<script src="https://cdn.jsdelivr.net/npm/axios/dist/axios.min.js"></script>' либо скачать к себе на сервер либо через CDN

// продолжение и использование библиотеки в проекте 